
export default function Icon({ code, size = 120 }) {
  const icons = {
    0: "☀️",    
    1: "🌤️",    
    2: "⛅",     
    3: "☁️",     
    45: "🌫️",    
    48: "🌫️",    
    51: "🌦️",    
    53: "🌦️",    
    55: "🌧️",   
    61: "🌧️",    
    63: "🌧️",   
    65: "🌧️",   
    71: "🌨️",    
    73: "❄️",     
    75: "❄️",    
    95: "⛈️",     
    96: "⛈️",     
    99: "⛈️"
  };

  const icon = icons[code] || "🌍";

  return (
    <div className="icon">{icon}</div>
  );
}